# Ex14: Формирование фреймворка
#
# На этом уроке мы начали создавать свой фреймворк.
# Он нам пригодится в дальнейшим, так как домашние задания следующего урока будут опираться на методы из этого фреймворка.
#
# Потом эта задача в том, чтобы повторить то, что мы проделали на уроке:
#
# - создать класс BaseCase в директории lib/
#
# - создать класс Assertions в директории lib/
#
# - создать тест TestUserAuth в директории tests/
#
# ===========================================================================
# Результатом работы должна быть ссылка на репозиторий, куда выложены эти классы.